Sorry, I just looked at this more closely today. I should not use var.log_group_arn as it is dynamically referenced to a log group I created. I still want to know if there is a way to test the reference to aws_cloudwatch_log_group.demo I created. As well as filter to sid = CloudWatchLog with syntax `And it has statement`

```hcl
 # aws_cloudwatch_log_group.demo will be created
  + resource "aws_cloudwatch_log_group" "demo" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/demo/test"
      + retention_in_days = 0
    }

  # aws_ecr_repository.demo will be created
  + resource "aws_ecr_repository" "demo" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "demo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

  # aws_kms_key.demo will be created
  + resource "aws_kms_key" "demo" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = "demo key 1"
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = (known after apply)
    }

  # aws_secretsmanager_secret.demo will be created
  + resource "aws_secretsmanager_secret" "demo" {
      + arn                     = (known after apply)
      + id                      = (known after apply)
      + name                    = "demo"
      + name_prefix             = (known after apply)
      + recovery_window_in_days = 30
      + rotation_enabled        = (known after apply)
    }

  # aws_ssm_parameter.demo will be created
  + resource "aws_ssm_parameter" "demo" {
      + arn     = (known after apply)
      + id      = (known after apply)
      + key_id  = (known after apply)
      + name    = "demo"
      + tier    = "Standard"
      + type    = "String"
      + value   = (sensitive value)
      + version = (known after apply)
    }

  # module.full_iam.data.aws_iam_policy_document.task will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "task"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "CloudWatchLog"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-b486f3d0",
                ]
              + variable = "aws:sourceVpc"
            }
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchMetric"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "aws:SecureTransport"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "my-metric-namespace",
                ]
              + variable = "cloudwatch:namespace"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-b496f3e0",
                ]
              + variable = "aws:sourceVpc"
            }
        }
      + statement {
          + actions   = [
              + "appmesh:StreamAggregatedResources",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AppmeshTLS"
        }
    }
```